In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import random

In [3]:
df = pd.read_csv("../Downloads/Expanded_data_with_more_features.csv")
df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [4]:
# Drop useless columns
df = df.drop('Unnamed: 0',axis=1)

In [4]:
df = df.drop('EthnicGroup',axis=1)

In [48]:
# compute average of all 3 test scores for each row
df['Average Score'] = round((df['WritingScore'] + df['MathScore'] + df['ReadingScore']) / 3,0)

In [6]:
df['WklyStudyHours'].unique()

array(['< 5', '5 - 10', '> 10', nan], dtype=object)

In [9]:
# create function that assigns a number to each unique value for study hours
def studyhours(hours):
    if hours == '< 5':
        return 1
    elif hours == '5 - 10':
        return 2
    elif hours == '> 10':
        return 3

In [15]:
# Create a new column by applying this function to the wklystudyhours column
df['WklyStudyHoursValue'] = df['WklyStudyHours'].apply(studyhours)

In [5]:
# fill means of transport with random choice of unique values
df['TransportMeans'].unique()
df['TransportMeans'] = df['TransportMeans'].fillna(random.choice(['school_bus', 'private']))

In [10]:
df.head()

,Gender,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore,Average Score,WklyStudyHoursValue
0,female,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74,72.0,1.0
1,female,some college,standard,NaN,married,sometimes,yes,0.0,school_bus,5 - 10,69,90,88,82.0,2.0
2,female,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91,90.0,1.0
3,male,associate's degree,free/reduced,none,married,never,no,1.0,school_bus,5 - 10,45,56,42,48.0,2.0
4,male,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75,76.0,2.0

In [11]:
df['TransportMeans'].unique()

array(['school_bus', 'private'], dtype=object)

In [12]:
df['ParentEduc'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school', nan],
      dtype=object)

In [6]:
# fill parent education null values with random choices of unique values for the column
df['ParentEduc'] = df['ParentEduc'].fillna(random.choice(["bachelor's degree", 'some college', "master's degree",
               "associate's degree", 'high school', 'some high school']))

In [8]:
# Fill Test prep null values with random choice from unique values
df['TestPrep'].unique()
df['TestPrep'] = df['TestPrep'].fillna(random.choice(['none', 'completed']))

In [15]:
df['ParentMaritalStatus'].unique()

array(['married', 'single', 'widowed', nan, 'divorced'], dtype=object)

In [16]:
# fill missing values for WklyStudyHoursValue column with the rounded mean value of the column
df['WklyStudyHoursValue'] = df['WklyStudyHoursValue'].fillna(round(df['WklyStudyHoursValue'].mean()))

In [17]:
df['WklyStudyHoursValue'].unique()

array([1., 2., 3.])

In [18]:
# Since a WklyStudyHoursValue of 2 corresponds with '5 - 10' study hours, fill all missing values with '5 - 10'
df['WklyStudyHours'] = df['WklyStudyHours'].fillna('5 - 10')

In [19]:
# fill missing NrSiblings values with the rounded mean of all NrSiblings values
df['NrSiblings'] = df['NrSiblings'].fillna(round(df['NrSiblings'].mean()))

In [21]:
# fill missing IsFirstChild values with a random choice of yes or no
df['IsFirstChild'] = df['IsFirstChild'].fillna(random.choice(['yes','no']))

In [19]:
# fill missing practicesport values with a random choice between its unique values
df['PracticeSport'] = df['PracticeSport'].fillna(random.choice(['regularly', 'sometimes', 'never']))

In [23]:
df = df.dropna()

In [24]:
df.isnull().sum()

Gender                 0
ParentEduc             0
LunchType              0
TestPrep               0
ParentMaritalStatus    0
PracticeSport          0
IsFirstChild           0
NrSiblings             0
TransportMeans         0
WklyStudyHours         0
MathScore              0
ReadingScore           0
WritingScore           0
Average Score          0
WklyStudyHoursValue    0
dtype: int64

In [55]:
df.head()

,Gender,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore,Average Score
0,female,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74,72.0
1,female,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,69,90,88,82.0
2,female,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91,90.0
3,male,associate's degree,free/reduced,none,married,never,no,1.0,school_bus,5 - 10,45,56,42,48.0
4,male,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75,76.0

In [54]:
# drop the WklyStudyHoursValue column, as we no longer need it
df = df.drop("WklyStudyHoursValue",axis=1)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 29451 entries, 0 to 30640
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               29451 non-null  object
 1   ParentEduc           29451 non-null  object
 2   LunchType            29451 non-null  object
 3   TestPrep             29451 non-null  object
 4   ParentMaritalStatus  29451 non-null  object
 5   PracticeSport        29451 non-null  object
 6   IsFirstChild         29451 non-null  object
 7   NrSiblings           29451 non-null  float64
 8   TransportMeans       29451 non-null  object
 9   WklyStudyHours       29451 non-null  object
 10  MathScore            29451 non-null  int64
 11  ReadingScore         29451 non-null  int64
 12  WritingScore         29451 non-null  int64
 13  Average Score        29451 non-null  float64
 14  WklyStudyHoursValue  29451 non-null  float64
dtypes: float64(3), int64(3), object(9)
memory usage: 3.6+ MB

In [56]:
# save cleaned dataframe to a csv file
df.to_csv("C://Users//brand//OneDrive//Desktop//Data Analysis Bootcamp//UCI-VIRT-DATA-PT-09-2023-U-LOLC//Project-1//Data//CleanedSchoolData.csv", index=False)